In [1]:
import pandas as pd
exam1 = [89,85,93,83]
labels  = ['Student A', 'Student B', 'Student C', 'Student D']

In [3]:
pd.Series(exam1,labels)

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [5]:
pd.Series(exam1,labels)['Student D']

83

In [7]:
d = {s:p for s,p in zip(labels,exam1)}
d

{'Student A': 89, 'Student B': 85, 'Student C': 93, 'Student D': 83}

In [9]:
pd.Series(d)

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [11]:
exam2 = [74,56,44,92]

e1 = pd.Series(exam1,labels)
e2 = pd.Series(exam2,labels)

In [83]:
e1 + e2

Student A    163
Student B    141
Student C    137
Student D    175
dtype: int64

In [15]:
e1 * e2

Student A    6586
Student B    4760
Student C    4092
Student D    7636
dtype: int64

In [17]:
e1 / 5

Student A    17.8
Student B    17.0
Student C    18.6
Student D    16.6
dtype: float64

In [19]:
df = pd.DataFrame({'e1':exam1, 'e2':exam2},index=labels)
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [21]:
df['e1']

Student A    89
Student B    85
Student C    93
Student D    83
Name: e1, dtype: int64

In [23]:
import numpy as np

In [25]:
data = np.array([exam1,exam2])
data.transpose()

array([[89, 74],
       [85, 56],
       [93, 44],
       [83, 92]])

In [27]:
df = pd.DataFrame(data.transpose(),index=labels,columns=['e1','e2'])
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [29]:
df.to_numpy()

array([[89, 74],
       [85, 56],
       [93, 44],
       [83, 92]])

In [31]:
df.shape

(4, 2)

In [33]:
df['e1']

Student A    89
Student B    85
Student C    93
Student D    83
Name: e1, dtype: int32

In [35]:
df.e1

Student A    89
Student B    85
Student C    93
Student D    83
Name: e1, dtype: int32

In [85]:
df['e3'] = [67,59,79,84]
df

ValueError: Length of values (4) does not match length of index (3)

In [39]:
df['semester1'] = df['e1'] + df['e2'] + df['e3']
df

           e1  e2  e3  semester1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [41]:
df.loc['Student C']

e1            93
e2            44
e3            79
semester1    216
Name: Student C, dtype: int64

In [43]:
df.loc['Student C','e2']

44

In [45]:
df.loc[['Student C','Student D'],['e2']]

           e2
Student C  44
Student D  92

In [47]:
df.iloc[1]

e1            85
e2            56
e3            59
semester1    200
Name: Student B, dtype: int64

In [49]:
df.iloc[2]

e1            93
e2            44
e3            79
semester1    216
Name: Student C, dtype: int64

In [51]:
df.iloc[1:,1]

Student B    56
Student C    44
Student D    92
Name: e2, dtype: int32

In [53]:
df.iloc[2:,1]

Student C    44
Student D    92
Name: e2, dtype: int32

In [55]:
df.iloc[1:,1]

Student B    56
Student C    44
Student D    92
Name: e2, dtype: int32

In [57]:
df['e2'] > 70

Student A     True
Student B    False
Student C    False
Student D     True
Name: e2, dtype: bool

In [81]:
df[df['e2'] > 70]

           e1  e2
Student A  89  74
Student D  83  92

In [79]:
df

           e1  e2
Student A  89  74
Student C  93  44
Student D  83  92

In [75]:
df

           e1  e2
Student A  89  74
Student C  93  44
Student D  83  92

In [71]:
df.reset_index()

       index  e1  e2
0  Student A  89  74
1  Student C  93  44
2  Student D  83  92